{
  "_class_name": "LatteT2V",
  "_diffusers_version": "0.24.0",
  "activation_fn": "gelu-approximate",
  "attention_bias": true,
  "attention_head_dim": 72,
  "attention_mode": "xformers",
  "attention_type": "default",
  "caption_channels": 4096,
  "cross_attention_dim": 1152,
  "double_self_attention": false,
  "dropout": 0.0,
  "in_channels": 4,
  "norm_elementwise_affine": false,
  "norm_eps": 1e-06,
  "norm_num_groups": 32,
  "norm_type": "ada_norm_single",
  "num_attention_heads": 16,
  "num_embeds_ada_norm": 1000,
  "num_layers": 28,
  "num_vector_embeds": null,
  "only_cross_attention": false,
  "out_channels": 8,
  "patch_size": 2,
  "patch_size_t": 1,
  "sample_size": [
    64,
    64
  ],
  "upcast_attention": false,
  "use_linear_projection": false,
  "video_length": 5
}
