{
  "_name_or_path": "MS_ShareGPT4V-7B",
  "architectures": [
    "Share4VLlamaForCausalLM"
  ],
  "bos_token_id": 1,
  "eos_token_id": 2,
  "freeze_mm_mlp_adapter": false,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "image_aspect_ratio": "pad",
  "image_grid_pinpoints": null,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 4096,
  "mm_hidden_size": 1024,
  "mm_projector_lr": null,
  "mm_projector_type": "mlp2x_gelu",
  "mm_use_im_patch_token": false,
  "mm_use_im_start_end": false,
  "mm_vision_select_feature": "patch",
  "mm_vision_select_layer": -2,
  "mm_vision_tower": "path/to/vit/configs",
  "mm_vision_tower_path":"/path/to/vit/weight",
  "model_type": "share4v",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "tie_word_embeddings": false,
  "dtype": "float16",
  "transformers_version": "4.31.0",
  "tune_entire_model": false,
  "tune_mm_mlp_adapter": false,
  "tune_vision_tower": false,
  "use_cache": true,
  "use_mm_proj": true,
  "vision_tower_lr": null,
  "vocab_size": 32000,
  "output_attentions": false,
  "output_hidden_states": false,
  "use_return_dict": true
}
